Revit 2027 API
ConceptualConstructionType.GetOpeningConstructionType Method
 Get an Opening ConceptualConstructionType by its ConceptualConstructionOpeningType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetOpeningConstructionType(
	Document ccda,
	ConceptualConstructionOpeningType typeEnum
)
Public Shared Function GetOpeningConstructionType (
	ccda As Document,
	typeEnum As ConceptualConstructionOpeningType
) As ElementId
public:
static ElementId^ GetOpeningConstructionType(
	Document^ ccda,
	ConceptualConstructionOpeningType typeEnum
)
static member GetOpeningConstructionType :
        ccda : Document *
        typeEnum : ConceptualConstructionOpeningType -> ElementId
Parameters
ccda Document
 The Document.
typeEnum ConceptualConstructionOpeningType
 The ConceptualConstructionOpeningType to get the ConceptualConstructionType for.
Return Value
ElementId
 Returns ElementId of a ConceptualConstructionType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The enum is invalid for ConceptualConstructionOpeningType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace